
# Pandas Continue
# Data Cleaning

In [ ]:
#Data Cleaning (IMP Part of Pandas)

In [ ]:
import pandas as pd
import numpy as np

In [ ]:
val1=np.array([1,np.nan,7,18])

Notice that numpy prefered a native floating point type this array this means that unlike the object
array supports fast operations pushed into compiled code you should be aware that Nan is a bit like data virus it infect any other object it touches .Regardless of the operation , the result of arithmetic with Nan will be another Nan.

In [ ]:
6 + np.nan # Its mean we dont add any number with nan

In [ ]:
7 * np.nan # Its its also not Multiply with nan

Numpy does provide some special aggregations that will ignore these missing values

In [ ]:
val1

In [ ]:
np.nansum(val1) #Look here we add all data

Keep in mind that Nan is specifically a floating point value , there is no equivalent Nan value for integers, String, or other types

# Nan and None in Pandas

Nan and None both have their place ,and Pandas is built to Handle the two of them nearly interchangeably , converting between them where appropriate.

In [ ]:
pd.Series([1,np.nan,2,None])

# Operating on Null Values

As we have seen, Pandas treats None and Nan as essentially interchangeable for indicating Missing or null values .To facilitate this convention , there are several usefull methods for deleting , removing,and replacing null values in pandas data structure .That are->

In [ ]:
# 1-isnull():Generate a boolean mask indicating missing values
# 2-notnull():Opposite of isnull()
# 3-dropna():Return a copy of the data with missing values filled or imputed
# 4-fillna():Return a copy of the data with missing values filled or imputed

We will conclude this section with a breif exploration and demonstration of these routines

In [ ]:
#Create DataFrame with Missing Values

In [ ]:
raw_data={'first_name':['Jason',np.nan,'Tina','Jake','Amy','Madhu'],
         'last_name':['Miller',np.nan,'Ali','Milner','Cooze','Patil'],
         'age':[42,np.nan,36,24,73,25],
         'sex':['M',np.nan,'F','M','F','F'],
         'unit-1':[4,np.nan,np.nan,2,3,4],
         'unit-2':[3,np.nan,np.nan,4,4,4]}
df=pd.DataFrame(raw_data,columns=['first_name','last_name','age','sex','unit-1','unit-2'])

In [ ]:
df

# Drop Missing Observation

In [ ]:
df_no_missing=df.dropna() #Here we are droping all values which have nan values
df_no_missing

# Drop rows where all cells in that row is Na

In [ ]:

df

In [ ]:
#Rows that has all Nan's Will be removes

In [ ]:
df_cleaned=df.dropna(how='all')#Its mean if there is any row which have all nan values this formula will drop the rows
df_cleaned

In [ ]:
#Craete a new Column full of missing values

In [ ]:
df['final_score']=np.nan
df

In [ ]:
#Drop Column if they only contain Missing Values

In [ ]:
df.dropna(axis=1,how='all')

# Fillna

In [ ]:
df

In [ ]:
df.fillna(0)
#See there all nan values is filled with 0, we have rights to take any values.in place of 0.

In [ ]:
#Fill in Missing in unit1 with the mean values of unit 1
#inplace = True,means that changes are saved to the df right away

In [ ]:
df['unit-1'].fillna(df['unit-1'].mean(),inplace=True)

In [ ]:
df

In [ ]:
#Fill in the Missing in unit-2 with each sex's mean value of unit-2

In [ ]:
df['unit-2'].fillna(df.groupby('sex')['unit-2'].transform('mean'),inplace=True)

In [ ]:
df

In [ ]:
#Lets Learn about Back Fill

In [ ]:
df.fillna(method='bfill')

In [ ]:
#Lets Learn about Forword Fill

In [ ]:
df.fillna(method='ffill',inplace=True)
df

In [ ]:
#fill Final-Score

In [ ]:
df['final_score'].fillna(df['unit-1']+df['unit-2'],inplace=True)
df

In [ ]:
df['Location']='Benglore'

In [ ]:
df

# Hierarchical indexing
upto this point focused primarily on one dimensional and two  dimensional objects ,respectively often it is useful to go beyond this and store higher dimensional data that is data indexed by more or two keys, while pandas does provide panel and panel 4D .objects that natively handle three dimension and four dimensional data.This is a far more common pattern in practice is to make use of hierarchical indexing (also known as multiindexing ) to incorporate multiple index levels with a single index in this way higher dimensional data can be compactly represent with the familier one dimensional series and two dimensional Data-Frame objects

In This Section, we will traverse across the direct creation of multiindex objects consideration when indexing ,slicing and computing statistics across multiple indexed data and useful routines for conversion between simple and hierarchically indexed -represtations of your data

We begin with standard imports

In [27]:
import pandas as pd

In [28]:
raw_data={'company':['Google','Google','Google','Google','Facebook','Facebook','Facebook','Facebook','Amazon','Amazon','Amazon','Amazon'],
         'project':['1st','1st','2nd','2nd','1st','1st','2nd','2nd','1st','1st','2nd','2nd'],
         'incharge':['sunder','ruth','benjamin','serger','mark','shery','eduardo','david','jeffrey','andy','keith','edilth'],
         'sales(in million)':[54,24,31,12,23,24,34,31,32,23,52,13],
         'profit(in million)':[14,8,9,4,10,11,14,13,12,7,22,4]}
df=pd.DataFrame(raw_data,columns=['company','project','incharge','sales(in million)','profit(in million)'])

In [29]:
df

     company project  incharge  sales(in million)  profit(in million)
0     Google     1st    sunder                 54                  14
1     Google     1st      ruth                 24                   8
2     Google     2nd  benjamin                 31                   9
3     Google     2nd    serger                 12                   4
4   Facebook     1st      mark                 23                  10
5   Facebook     1st     shery                 24                  11
6   Facebook     2nd   eduardo                 34                  14
7   Facebook     2nd     david                 31                  13
8     Amazon     1st   jeffrey                 32                  12
9     Amazon     1st      andy                 23                   7
10    Amazon     2nd     keith                 52                  22
11    Amazon     2nd    edilth                 13                   4

In [30]:
df.shape

(12, 5)

In [ ]:
#Set The hierarchical but leave the column inplace

In [31]:
df.set_index(['company','project','incharge'],drop=False)

                            company project  incharge  sales(in million)  \
company  project incharge
Google   1st     sunder      Google     1st    sunder                 54
                 ruth        Google     1st      ruth                 24
         2nd     benjamin    Google     2nd  benjamin                 31
                 serger      Google     2nd    serger                 12
Facebook 1st     mark      Facebook     1st      mark                 23
                 shery     Facebook     1st     shery                 24
         2nd     eduardo   Facebook     2nd   eduardo                 34
                 david     Facebook     2nd     david                 31
Amazon   1st     jeffrey     Amazon     1st   jeffrey                 32
                 andy        Amazon     1st      andy                 23
         2nd     keith       Amazon     2nd     keith                 52
                 edilth      Amazon     2nd    edilth                 13

                           profit(in million)
company  project incharge
Google   1st     sunder                    14
                 ruth                       8
         2nd     benjamin                   9
                 serger                     4
Facebook 1st     mark                      10
                 shery                     11
         2nd     eduardo                   14
                 david                     13
Amazon   1st     jeffrey                   12
                 andy                       7
         2nd     keith                     22
                 edilth                     4

In [ ]:
#Set the Hierarchical index to be by company and then by project

In [34]:
df

     company project  incharge  sales(in million)  profit(in million)
0     Google     1st    sunder                 54                  14
1     Google     1st      ruth                 24                   8
2     Google     2nd  benjamin                 31                   9
3     Google     2nd    serger                 12                   4
4   Facebook     1st      mark                 23                  10
5   Facebook     1st     shery                 24                  11
6   Facebook     2nd   eduardo                 34                  14
7   Facebook     2nd     david                 31                  13
8     Amazon     1st   jeffrey                 32                  12
9     Amazon     1st      andy                 23                   7
10    Amazon     2nd     keith                 52                  22
11    Amazon     2nd    edilth                 13                   4

In [35]:
df.set_index(['company','incharge'],drop=True,inplace=True)

In [36]:
df

                  project  sales(in million)  profit(in million)
company  incharge
Google   sunder       1st                 54                  14
         ruth         1st                 24                   8
         benjamin     2nd                 31                   9
         serger       2nd                 12                   4
Facebook mark         1st                 23                  10
         shery        1st                 24                  11
         eduardo      2nd                 34                  14
         david        2nd                 31                  13
Amazon   jeffrey      1st                 32                  12
         andy         1st                 23                   7
         keith        2nd                 52                  22
         edilth       2nd                 13                   4

In [ ]:
#Summarize the result by company

In [37]:
df.sum(level='company')

C:\Users\safar\AppData\Local\Temp\ipykernel_6320\2410658861.py:1: FutureWarning: Using the level keyword in DataFrame and Series aggregations is deprecated and will be removed in a future version. Use groupby instead. df.sum(level=1) should use df.groupby(level=1).sum().
  df.sum(level='company')

               project  sales(in million)  profit(in million)
company
Google    1st1st2nd2nd                121                  35
Facebook  1st1st2nd2nd                112                  48
Amazon    1st1st2nd2nd                120                  45

# Data Manipulation

In [ ]:
import pandas as pd
import numpy as np
import warnings
warnings.filterwarnings('ignore')

In [38]:
titanic_train=pd.read_csv('https://raw.githubusercontent.com/training-ml/Files/main/titanic_train.csv')

In [39]:
titanic_train.head()

,Unnamed: 0,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [ ]:
#How to check unique values of any column

In [40]:
titanic_train['Survived'].unique()

array([0, 1], dtype=int64)

In [41]:
new_survived=pd.Categorical(titanic_train['Survived'])
new_survived=new_survived.rename_categories(['Died','Survived'])
new_survived.describe()

            counts     freqs
categories
Died           549  0.616162
Survived       342  0.383838

In [ ]:
#Another Example

In [42]:
titanic_train['Pclass'].unique()

array([3, 1, 2], dtype=int64)

In [43]:
new_place=pd.Categorical(titanic_train['Pclass'],ordered=True)
new_place=new_place.rename_categories(['class1','class2','class3'])
new_place.describe()

            counts     freqs
categories
class1         216  0.242424
class2         184  0.206510
class3         491  0.551066

In [ ]:
#Reassign New Name to pclass

In [44]:
titanic_train['Pclass']=new_place

In [ ]:
#Check if they have changed

In [45]:
titanic_train.head()

,Unnamed: 0,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,0,1,0,class3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,1,2,1,class1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,2,3,1,class3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,3,4,1,class1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,4,5,0,class3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [ ]:
#Find all the passengers who's age is Missing.

In [46]:
age_missing=titanic_train[titanic_train.Age.isin(['Nan'])]
age_missing

Empty DataFrame
Columns: [Unnamed: 0, PassengerId, Survived, Pclass, Name, Sex, Age, SibSp, Parch, Ticket, Fare, Cabin, Embarked]
Index: []

In [ ]:
#Similarly you can fetch rows based on list of numbers like titanic_train[titanic_train.Age.isin([15])]
#but you cannot pass condtition inside 'isin()'

In [47]:
titanic_train.isna().sum()

Unnamed: 0       0
PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [ ]:

#Find only those passengers who's age is present in the dataset(equal to not in)

In [ ]:
titanic_with_age=titanic_train[~titanic_train.Age.isin(['Nan'])] # ~ its ,meaning, is not in
titanic_with_age

In [ ]:
#Find the Maximum Fare

In [ ]:
max_fare=titanic_train[titanic_train.Fare.isin([max(titanic_train['Fare'])])]
max_fare

# Series Manipulation

In [ ]:
import  numpy as np
import pandas as pd
import warnings
warnings.filterwarnings('ignore')

In [ ]:
#You can give your own index names

In [48]:
ser1=pd.Series(data=[1,2,3,4],index=['CA','OR','CO','AZ'])
ser1

CA    1
OR    2
CO    3
AZ    4
dtype: int64

In [ ]:
#Indexing by name of the item/object

In [49]:
print("\n Indexing by name of the item/object(string identifiers)\n",'-'*56,sep='')
print("Value for CA in ser1:",ser1['CA'])
print("Values for AZ in ser1 :",ser1['AZ'])

 Indexing by name of the item/object(string identifiers)
--------------------------------------------------------
Value for CA in ser1: 1
Values for AZ in ser1 : 4

In [ ]:
#You can also Fetch element by its positional index

In [50]:
print("\n Indexing by number (Positional Value in the Series)\n",'-'*52,sep='')
print("value for AZ in ser1:",ser1[3])
print('value for CA in ser1:',ser1[0])

 Indexing by number (Positional Value in the Series)
----------------------------------------------------
value for AZ in ser1: 4
value for CA in ser1: 1

In [51]:
ser1

CA    1
OR    2
CO    3
AZ    4
dtype: int64

In [52]:
print("\n Indexing by a range\n",'-'*25,sep='')
print("value for OR,CO,AZ in ser1:\n",ser1[1:4],sep='')

 Indexing by a range
-------------------------
value for OR,CO,AZ in ser1:
OR    2
CO    3
AZ    4
dtype: int64

In [53]:
ser1=pd.Series([1,2,3,4,10],['CA','OR','CO','AZ','NV'])

In [54]:
ser2=pd.Series([1,2,5,6,9,],['CA','OR','CO','AZ','NV'])

In [55]:
print('ser1\n',ser1)
print('*'*30)
print('ser2\n',ser2)

ser1
 CA     1
OR     2
CO     3
AZ     4
NV    10
dtype: int64
******************************
ser2
 CA    1
OR    2
CO    5
AZ    6
NV    9
dtype: int64

In [ ]:
#Lets add  both series

In [56]:
ser3=ser1+ser2
print("After adding the two series the results like this ...\n",'-'*59,sep='')
print(ser3)
print("\n Python Tries to add value where it find common index name and keeps Nan where indices are missing\n")

After adding the two series the results like this ...
-----------------------------------------------------------
CA     2
OR     4
CO     8
AZ    10
NV    19
dtype: int64

 Python Tries to add value where it find common index name and keeps Nan where indices are missing

In [ ]:
#Similarly you can multiply,subtract and do other operation on it.